package org.vaadin.example.bookstore.backend.resourcebundle;

import java.util.ListResourceBundle;

public class MockDataResource_fa_IR extends ListResourceBundle {

    @Override
    protected Object[][] getContents() {
        return new Object[][] {
                {"categoryNames", new String[] {
                        "رمان", "تخیلی", "کودکان", "ترسناک", "تاریخی", "فلسفی", "پرفروش ترین" }},
                {"word1", new String[] { "نخل‌های بی‌سر", "بامداد خمار", "روی ماه خداوند را ببوس",
                        "منِ او", "چراغ‌ها را من خاموش می‌کنم", "دا", "شب سراب", "کافه پیانو",
                        "قهوه سردِ آقای نویسنده", "پاییز، فصل آخر سال است", "دخیل عشق"
                        , "کمی دیرتر", "قیدار", "رهش", "طریق بسمل شدن", "تسلی بخشی های فلسفه",
                        "رهایی از زندان ذهن", "چگونه درباره چیزهای عجیب بیاندیشیم", "وقتی نیچه گریست"
                        , "درمان شوپنهاور", "تاملات", "مساله اسپینوزا", "تاریخچه تقریبا همه چیز",
                        "مامان و معنی زندگی", "ساعت ساز نابینا", "پرسیدن مهم تر از پاسخ دادن است",
                        "هنر درمان", "راز فال ورق", "سفر به مرکز زمین", "ماشین زمان", "بازی بزرگ",
                        "چشم زمان", "شهر و ستارگان", "ایزدان هم", "آخرین جواب",
                        "برجیس را بخر! (و داستان‌های دیگر)", "به کجا می‌رویم؟", "ریگی در آسمان",
                        "مریخی", "جنگ پیرمرد", "سه جرم کیهانی", "بیگانه", "اطلس ابر", "جنگ جهانی ز",
                        "1984", "فارنهایت 451", "جنگاوران اخترناو", "حکایت‌های مریخ", "گزارش اقلیت",
                        "ابدی‌ها", "جهش، خاطرات روز بعد", "خط زمان", "نژاد آندرمدا", "طعمه", "اواتار",
                        "میان‌ستاره‌ای به روایت علم",
                        "علم در ادبیات علمی تخیلی: 83 پیشگویی علمی تخیلی که واقعیت علمی پیدا کرد",
                        "علمی-تخیلی", "قصه های خوب برای بچه های خوب",
                        "گربه ناقلا", "خاله سوسکه", "شعر قند و عسل",
                        "بافنده داننده", "خیر و شر", "گربه تنبل", "خاله قورباغه",
                        "قصه های تازه از کتاب های کهن",
                        "چکمه", "کیسه برنج", "قصه های مجید", "مربای شیرین", "مهمان مامان", "تنور",
                        "شما که غریبه نیستید ", "لبخند انار", "ماهی سیاه کوچولو",
                        "اولدوز و کلاغ ها، اولدوز و عروسک سخنگو، تلخون، بی نام، ",
                        "یک هلو هزار هلو", "۲۴ ساعت در خواب و بیداری", "کچل کفتر باز ",
                        "سال های ابری ", "درشتی ", "کی برمیگردی داداش جان ", "رنگینه",
                        "ابر سیاه هزار چشم ", "گل طلا و کلاش قرمز", "آقا گاوه", "خانم اردکه",
                        "گرگ و میش", "جن گیر", "خط خون", "اُورفِن استوری", "دراکولا",
                        "نکرونومیکون", "جادوی مقدس آبرامِلین ساحر", "گریمویرز بدون‌عنوان",
                        "وُینیخ", "کلید کوچکتر سلیمان", "قانون‌نامه گیگاس", "سویگا",
                        "جهنم تومینو", "گریمویرز اعظم", "نیش خون آشام اثر تومی دونبوند",
                        "چوبه‌ی دار خون‌آشام", "سرزمین اشباح", "شکارچیان شبح", "امپریالیسم",
                        "قرن دیوانه من", "راه باریک آزادی", "شاخه ی زرین", "مهاتما گاندی",
                        "هنر در گذر زمان", "داستان خاستگاه انسان و جهان هستی",
                        "ترامپ در خانه ی سفید", "از ثروت به قدرت", "سوسیالیسم",
                        "اسطوره ی عصیان", "جستارهایی درباره تئوری توطئه در ایران",
                        "هیتلر", "سیاست نامه", "دنیای سوفی", "بار هستی", "تسلی بخشی‌های فلسفه",
                        "مسئله‌ی اسپینوزا", "عدالت", "در باب حکمت زندگی", "فلسفه‌ای برای زندگی",
                        "اسطوره سیزیف", "آتش بدون دود", "از شيطان آموخت و سوزاند", "اسرار گنج دره جني",
                        "اسفار كاتبان", "انتري كه لوطي‌اش مرده بود", "اهل غرق", "بازي آخر بانو",
                        "اغ بلور ", "بوف كور", "تنگسير", "ثريا در اغما", "جاي خالي سلوچ ",
                        "چراغ‌ها را من خاموش مي‌كنم", "چشمهايش", "چمدان", "خانه ادريسيها", "خمره",
                        "دايي جان ناپلئون", "رازهاي سرزمين من", "روزگار سپري شده مردم سالخورده",
                        "روي ماه خداوند را ببوس", "زمستان 62", "زنان بدون مردان", "زيبا",
                        "سال بلوا ", "سمفوني مردگان", "سنگر و قمقمه‌هاي خالي", "سووشون",
                        "سه قطره خون", "سهم من", "سياحتنامه ابراهيم‌بيگ", "شادكامان دره قره‌سو",
                        "شازده احتجاب", "شطرنج با ماشين قيامت", "شما كه غريبه نيستيد",
                        "شماس شامي", "شوهر آهو خانم", "طوبا و معناي شب", "عزاداران بيل",
                        "كافه پيانو", "كليدر" }},
                {"word2", new String[] {""}}
        };
    }
}

