package org.vaadin.example.bookstore.backend.resourcebundle;

import java.util.ListResourceBundle;

public class MockDataResource_fa_IR extends ListResourceBundle {

    @Override
    protected Object[][] getContents() {
        return new Object[][] {
                {"categoryNames", new String[] {
                        "کتابهای کودکان", "پرفروش ترین ها", "رمان", "اسرار آمیز",
                        "ترسناک", "تخیلی", "غیر تخیلی", "کتابهای آشپزی" }},
                {"word1", new String[] { "هنر", "تسلط یافتن",
                        "رموز", "دوری کردن از", "برای سرگرمی و سود ",
                        "چگونگی شکست  خوردن در", "۱۰ واقعیت مهم در مورد",
                        "راهنمای نهایی برای", "کتاب", "زنده ماندن", "دانشنامه",
                        "خیلی زیاد", "یادگیری اصول اولیه", "راه ارزان برای",
                        "عالی بودن در", "تغییر دهنده زندگی", "روش وادین",
                        "یکی شدن با", "راهنمای مبتدیان به",
                        "راهنمای کامل بصری برای", "مادر همه مراجع" }},
                {"word2", new String[] { "باغبانی",
                        "زندگی سالم داشتن", "طراحی خانه های درختی", "امنیت خانه",
                        "سفر بین قاره ای", "مدیتیشن", "هاکی روی یخ",
                        "آموزش و پرورش کودکان", "برنامه نویسی کامپیوتر", "جدول درختی وادین",
                        "حمام زمستانی", "نواختن ویولن سل", "آدمک ها", "نوارهای لاستیکی",
                        "ناراحت بودن", "دیباگ کردن", "پابرهنه دویدن",
                        "صحبت در مقابل تعداد زیادی مخاطب", "تولید نرم افزار", "سوزن های غول پیکر",
                        "فیلها", "خوشحال نگه داشتن همسر" }}
        };
    }
}

